; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_4 ?v8 - type_2 ?v4 - type_3)
 	      (pred_1 ?v3 - object ?v4 - type_3)
	      (pred_3 ?v8 - type_2 ?v7 - type_1)
	      (pred_2 ?v8 - type_2 ?v3 - object ?v7 - type_1))

   (:action op_3
       :parameters  (?v8 - type_2 ?v6 ?v5 - type_3)
       :precondition (and  (pred_4 ?v8 ?v6))
       :effect (and  (pred_4 ?v8 ?v5)
		     (not (pred_4 ?v8 ?v6))))

   (:action op_1
       :parameters (?v8 - type_2 ?v1 - object ?v2 - type_3 ?v7 - type_1)
       :precondition  (and  (pred_1 ?v1 ?v2) (pred_4 ?v8 ?v2) (pred_3 ?v8 ?v7))
       :effect (and (pred_2 ?v8 ?v1 ?v7)
		    (not (pred_1 ?v1 ?v2)) 
		    (not (pred_3 ?v8 ?v7))))

   (:action op_2
       :parameters (?v8 - type_2 ?v1 - object ?v2 - type_3 ?v7 - type_1)
       :precondition  (and  (pred_2 ?v8 ?v1 ?v7) (pred_4 ?v8 ?v2))
       :effect (and (pred_1 ?v1 ?v2)
		    (pred_3 ?v8 ?v7)
		    (not (pred_2 ?v8 ?v1 ?v7)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_05 obj_04 - type_2
obj_07 obj_01 obj_02 obj_06 - type_1
obj_11 obj_10 obj_09 - type_3
obj_08 obj_03 obj_12 - object)
(:init
(pred_4 obj_05 obj_10)
(pred_3 obj_05 obj_07)
(pred_3 obj_05 obj_01)
(pred_4 obj_04 obj_09)
(pred_3 obj_04 obj_02)
(pred_3 obj_04 obj_06)
(pred_1 obj_08 obj_09)
(pred_1 obj_03 obj_11)
(pred_1 obj_12 obj_11)
)
(:goal
(and
(pred_1 obj_08 obj_11)
(pred_1 obj_03 obj_09)
(pred_1 obj_12 obj_11)
)
)

(:constraints
  (always (not (pred_4 obj_05 obj_09)))
)
)

; plan
1. (op_3 obj_05 obj_10 obj_11)
   deleted: (pred_4 obj_05 obj_10)
   added: (pred_4 obj_05 obj_11)
   goals met: 1 of 3
2. (op_1 obj_04 obj_08 obj_09 obj_06)
   deleted: (pred_1 obj_08 obj_09) (pred_3 obj_04 obj_06)
   added: (pred_2 obj_04 obj_08 obj_06)
   goals met: 1 of 3
3. (op_3 obj_04 obj_09 obj_11)
   deleted: (pred_4 obj_04 obj_09)
   added: (pred_4 obj_04 obj_11)
   goals met: 1 of 3
4. (op_2 obj_04 obj_08 obj_11 obj_06)
   deleted: (pred_2 obj_04 obj_08 obj_06)
   added: (pred_1 obj_08 obj_11) (pred_3 obj_04 obj_06)
   goals met: 2 of 3
5. (op_1 obj_04 obj_03 obj_11 obj_06)
   deleted: (pred_1 obj_03 obj_11) (pred_3 obj_04 obj_06)
   added: (pred_2 obj_04 obj_03 obj_06)
   goals met: 2 of 3
6. (op_3 obj_04 obj_11 obj_09)
   deleted: (pred_4 obj_04 obj_11)
   added: (pred_4 obj_04 obj_09)
   goals met: 2 of 3
7. (op_2 obj_04 obj_03 obj_09 obj_06)
   deleted: (pred_2 obj_04 obj_03 obj_06)
   added: (pred_1 obj_03 obj_09) (pred_3 obj_04 obj_06)
   goals met: 3 of 3
